In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(data=[['ss','A1','Male',34],['ss','A1','Male',44],['ts','A1','Female',14],['ts','A1','Female',24],
                        ['sls','B1','Male',47],['sls','B1','Male',74],['sps','B1','Female',38],['sps','B1','Male',35],
                        ['sms','C1','Female',17],['sms','C1','Female',25],['tss','C1','Female',29],['tss','C1','Male',39],
                       ],columns=['Team','Player Group','Sex','Age'])

In [3]:
df

   Team Player Group     Sex  Age
0    ss           A1    Male   34
1    ss           A1    Male   44
2    ts           A1  Female   14
3    ts           A1  Female   24
4   sls           B1    Male   47
5   sls           B1    Male   74
6   sps           B1  Female   38
7   sps           B1    Male   35
8   sms           C1  Female   17
9   sms           C1  Female   25
10  tss           C1  Female   29
11  tss           C1    Male   39

In [4]:
df.count()

Team            12
Player Group    12
Sex             12
Age             12
dtype: int64

In [8]:
df.values

array([['ss', 'A1', 'Male', 34],
       ['ss', 'A1', 'Male', 44],
       ['ts', 'A1', 'Female', 14],
       ['ts', 'A1', 'Female', 24],
       ['sls', 'B1', 'Male', 47],
       ['sls', 'B1', 'Male', 74],
       ['sps', 'B1', 'Female', 38],
       ['sps', 'B1', 'Male', 35],
       ['sms', 'C1', 'Female', 17],
       ['sms', 'C1', 'Female', 25],
       ['tss', 'C1', 'Female', 29],
       ['tss', 'C1', 'Male', 39]], dtype=object)

In [9]:
df.var

<bound method DataFrame.var of    Team Player Group     Sex  Age
0    ss           A1    Male   34
1    ss           A1    Male   44
2    ts           A1  Female   14
3    ts           A1  Female   24
4   sls           B1    Male   47
5   sls           B1    Male   74
6   sps           B1  Female   38
7   sps           B1    Male   35
8   sms           C1  Female   17
9   sms           C1  Female   25
10  tss           C1  Female   29
11  tss           C1    Male   39>

In [10]:
df.get("Team")

0      ss
1      ss
2      ts
3      ts
4     sls
5     sls
6     sps
7     sps
8     sms
9     sms
10    tss
11    tss
Name: Team, dtype: object

In [11]:
df.get("Team").value_counts()

tss    2
sls    2
ss     2
sms    2
sps    2
ts     2
Name: Team, dtype: int64

In [13]:
l1 = dir(df.get("Team"))

In [17]:
df.get("Team").unique()

array(['ss', 'ts', 'sls', 'sps', 'sms', 'tss'], dtype=object)

In [18]:
df.get("Team").nunique()

6

In [19]:
df.get("Sex").value_counts()

Male      6
Female    6
Name: Sex, dtype: int64

In [20]:
byteam = df.groupby("Team")

In [22]:
byteam.sum()

      Age
Team
sls   121
sms    42
sps    73
ss     78
ts     38
tss    68

In [37]:
df["Marks"] = np.linspace(60,93,num=12)

In [38]:
df

   Team Player Group     Sex  Age  Marks
0    ss           A1    Male   34   60.0
1    ss           A1    Male   44   63.0
2    ts           A1  Female   14   66.0
3    ts           A1  Female   24   69.0
4   sls           B1    Male   47   72.0
5   sls           B1    Male   74   75.0
6   sps           B1  Female   38   78.0
7   sps           B1    Male   35   81.0
8   sms           C1  Female   17   84.0
9   sms           C1  Female   25   87.0
10  tss           C1  Female   29   90.0
11  tss           C1    Male   39   93.0

In [39]:
df.get("Marks").sum()

918.0

In [40]:
df.get("Marks").mean()

76.5

In [41]:
df.get("Marks").median()

76.5

In [42]:
df.get("Marks").std()

10.816653826391969

In [43]:
df.groupby("Sex").sum()

        Age  Marks
Sex
Female  147  474.0
Male    273  444.0

In [44]:
df.groupby("Sex").mean()

         Age  Marks
Sex
Female  24.5   79.0
Male    45.5   74.0

In [45]:
df.groupby("Sex").median()

         Age  Marks
Sex
Female  24.5   81.0
Male    41.5   73.5

In [46]:
df.groupby("Sex").std()

              Age      Marks
Sex
Female   8.596511   9.797959
Male    14.842507  12.099587

In [47]:
df.groupby("Team").describe()

       Age                                                  Marks        \
     count  mean        std   min    25%   50%    75%   max count  mean
Team
sls    2.0  60.5  19.091883  47.0  53.75  60.5  67.25  74.0   2.0  73.5
sms    2.0  21.0   5.656854  17.0  19.00  21.0  23.00  25.0   2.0  85.5
sps    2.0  36.5   2.121320  35.0  35.75  36.5  37.25  38.0   2.0  79.5
ss     2.0  39.0   7.071068  34.0  36.50  39.0  41.50  44.0   2.0  61.5
ts     2.0  19.0   7.071068  14.0  16.50  19.0  21.50  24.0   2.0  67.5
tss    2.0  34.0   7.071068  29.0  31.50  34.0  36.50  39.0   2.0  91.5


          std   min    25%   50%    75%   max
Team
sls   2.12132  72.0  72.75  73.5  74.25  75.0
sms   2.12132  84.0  84.75  85.5  86.25  87.0
sps   2.12132  78.0  78.75  79.5  80.25  81.0
ss    2.12132  60.0  60.75  61.5  62.25  63.0
ts    2.12132  66.0  66.75  67.5  68.25  69.0
tss   2.12132  90.0  90.75  91.5  92.25  93.0

In [48]:
df.groupby("Sex").describe()

         Age                                                  Marks        \
       count  mean        std   min    25%   50%    75%   max count  mean
Sex
Female   6.0  24.5   8.596511  14.0  18.75  24.5  28.00  38.0   6.0  79.0
Male     6.0  45.5  14.842507  34.0  36.00  41.5  46.25  74.0   6.0  74.0


              std   min    25%   50%    75%   max
Sex
Female   9.797959  66.0  71.25  81.0  86.25  90.0
Male    12.099587  60.0  65.25  73.5  79.50  93.0

In [50]:
df.get("Team").value_counts()

tss    2
sls    2
ss     2
sms    2
sps    2
ts     2
Name: Team, dtype: int64

In [51]:
def well_done(x):
    if x>80.:
        return "Congrats Team Member"
    else:
        return "Keep it up Tema Member"

In [57]:
def age_class(x):
    x = int(x)
    if x>20 and x<40:
        return "Adult"
    elif x>=40 and x<55:
        return "Middle Age"
    elif x>=55:
        return "Old Age"
    else:
        return "Teen"

In [58]:
df["Message delivered"] = df["Marks"].apply(well_done)

In [60]:
df["Age review"] = df.get("Age").apply(age_class)

In [61]:
df

   Team Player Group     Sex  Age  Marks       Message delivered  Age review
0    ss           A1    Male   34   60.0  Keep it up Tema Member       Adult
1    ss           A1    Male   44   63.0  Keep it up Tema Member  Middle Age
2    ts           A1  Female   14   66.0  Keep it up Tema Member        Teen
3    ts           A1  Female   24   69.0  Keep it up Tema Member       Adult
4   sls           B1    Male   47   72.0  Keep it up Tema Member  Middle Age
5   sls           B1    Male   74   75.0  Keep it up Tema Member     Old Age
6   sps           B1  Female   38   78.0  Keep it up Tema Member       Adult
7   sps           B1    Male   35   81.0    Congrats Team Member       Adult
8   sms           C1  Female   17   84.0    Congrats Team Member        Teen
9   sms           C1  Female   25   87.0    Congrats Team Member       Adult
10  tss           C1  Female   29   90.0    Congrats Team Member       Adult
11  tss           C1    Male   39   93.0    Congrats Team Member       Adult